package LangForU_DevTeam.LangForU.courses;

/**
 * Енумерация (Enumeration), която дефинира възможните нива на владеене на език за курсовете.
 * Включва нива съгласно Общата европейска езикова рамка (CEFR) - A1 до C2,
 * както и нива за китайски език HSK.
 */
public enum Level {
    /**
     * Нива съгласно Общата европейска езикова рамка (CEFR).
     */
    A1,
    A2,
    A1_A2, // Комбинирано ниво
    B1,
    B2,
    B1_B2, // Комбинирано ниво
    C1,
    C2,
    C1_C2, // Комбинирано ниво

    /**
     * Нива съгласно Hanyu Shuiping Kaoshi (HSK) - стандартизиран тест за владеене на китайски език.
     */
    HSK1,
    HSK2,
    HSK3,
    HSK4
}