package LangForU_DevTeam.LangForU.email;

/**
 * Интерфейс, който дефинира основния договор (contract) за изпращане на имейли.
 * Всеки клас, който иска да предоставя функционалност за изпращане на имейли,
 * трябва да имплементира този интерфейс.
 * Това позволява гъвкавост и лесна смяна на имплементациите (напр. от стандартен SMTP към външен API).
 */
public interface EmailSender {

    /**
     * Метод за изпращане на имейл.
     *
     * @param to    Имейл адресът на получателя.
     * @param email Съдържанието (тялото) на имейла, което трябва да бъде изпратено.
     */
    void send(String to, String email);
}