package LangForU_DevTeam.LangForU.appuser;

/**
 * Енумерация (Enumeration), която дефинира възможните роли на потребителите в системата.
 * Ролите се използват за контрол на достъпа и оторизация в рамките на приложението,
 * най-често чрез Spring Security.
 */
public enum AppUserRole {

    /**
     * Роля "Администратор".
     * Потребителите с тази роля обикновено имат пълен достъп до всички функционалности
     * на системата, включително управление на потребители, курсове и друго съдържание.
     */
    ADMIN,

    /**
     * Роля "Потребител".
     * Това е стандартната роля за повечето регистрирани потребители.
     * Те имат ограничен достъп, съобразен с основните функционалности на приложението,
     * като например записване за курсове и достъп до учебно съдържание.
     */
    USER
}